fedetft/miosix-kernel-unofficial/miosix/arch/cortexM3_efm32gg/efm32gg332f1024_wandstem/interfaces-impl/transceiver.cpp
CC2520ExceptionBitmask Transceiver::getExceptions(int part)
{
    unsigned int result=0;
    if(part & 0b001)
        result|=static_cast<unsigned int>(readReg(CC2520Register::EXCFLAG0));
    if(part & 0b010)
        result|=static_cast<unsigned int>(readReg(CC2520Register::EXCFLAG1))<<8;
    if(part & 0b100)
        result|=static_cast<unsigned int>(readReg(CC2520Register::EXCFLAG2))<<16;
    return result;
}

void Transceiver::clearException(CC2520ExceptionBitmask exc)
{
    if(exc & 0xff)     writeReg(CC2520Register::EXCFLAG0,~( exc      & 0xff));
    if(exc & 0xff00)   writeReg(CC2520Register::EXCFLAG1,~((exc>>8)  & 0xff));
    if(exc & 0xff0000) writeReg(CC2520Register::EXCFLAG2,~((exc>>16) & 0xff));
}

void Transceiver::clearAllExceptions()
{
    //Exception channel B : SFD | TX_FRM_DONE | RX_FRM_DONE
    //These are the "expected" exceptions
    //Complementary exception channel B : all other exceptions
    //These are the "unexpected" exceptions, something went wrong
    if(transceiver::excChB::value() || complExcChB::value())
    {
        writeReg(CC2520Register::EXCFLAG0,0);
        writeReg(CC2520Register::EXCFLAG1,0);
        writeReg(CC2520Register::EXCFLAG2,0);
    }
}

void Transceiver::waitXosc()
{
    //The simplest possible implementation is
    //while(internalSpi::miso::value()==0) ;
    //but it is too energy hungry

    DeepSleepLock dslck;

    auto misoPin=internalSpi::miso::getPin();
    FastInterruptDisableLock dLock;
    waiting=Thread::IRQgetCurrentThread();
    IRQenableGpioIrq(misoPin);
    do {
        Thread::IRQwait();
        {
            FastInterruptEnableLock eLock(dLock);
            Thread::yield();
        }
    } while(waiting);
    IRQdisableGpioIrq(misoPin);
}

unsigned char Transceiver::txPower(int dBm)
{
    CC2520TxPower result;
    if(dBm>=5)       result=CC2520TxPower::P_5;
    else if(dBm>=3)  result=CC2520TxPower::P_3;
    else if(dBm==2)  result=CC2520TxPower::P_2;
    else if(dBm==1)  result=CC2520TxPower::P_1;
    else if(dBm==0)  result=CC2520TxPower::P_0;
    else if(dBm>=-2) result=CC2520TxPower::P_m2;
    else if(dBm>=-7) result=CC2520TxPower::P_m7;
    else             result=CC2520TxPower::P_m18;
    return toByte(result);
}

short int Transceiver::decodeRssi(unsigned char reg)
{
    int rawRssi=static_cast<int>(reg);
    if(rawRssi & 0x80) rawRssi-=256; //8 bit 2's complement to int
    return rawRssi-76; //See datasheet
}

void Transceiver::enableTransceiverPowerDomain()
{
    Lock<FastMutex> plock(powerMutex);

    if(transceiverPowerDomainRefCount == 0)
    {
        //Enable power domain
        transceiver::vregEn::high();
        transceiver::reset::low();
        
        //The voltage at the the flash rises in about 70us,
        //observed using an oscilloscope. The voltage at the
        //transceiver is even faster, but the spec says 100us
        //TODO: power hungry, but we can't use the rtc as only one thread
        //can use it at a time, and we may be called by another thread
        delayUs(100);
        
        transceiver::cs::high();

        flash::cs::high();
        flash::hold::high();
        
        spi.enable();
    }

    ++transceiverPowerDomainRefCount;
}

void Transceiver::disableTransceiverPowerDomain()
{
    Lock<FastMutex> plock(powerMutex);

    --transceiverPowerDomainRefCount;

    if(transceiverPowerDomainRefCount==0)
    {
        //Disable power domain
        spi.disable();
        
        flash::hold::low();
        flash::cs::low();
        
        transceiver::reset::low();
        transceiver::cs::low();
        
        transceiver::vregEn::low();
    } else if(transceiverPowerDomainRefCount<0) {
        throw runtime_error("transceiver power domain refcount is negative");
    }
}

} //namespace miosix
